/-

2.3.関数の抽象化と評価

Lean は、式から関数を作成するための
fun（または λ）キーワードを次のように提供します。

-/

#check fun (x : Nat) => x + 5-- λ and fun mean the same thing
#check λ (x : Nat) => x + 5

/-
この例では、型 Nat を推測できます。-/

#check fun x => x + 5
#check λ x => x + 5

/-
必要なパラメータを渡すことで、ラムダ関数を評価できます。
-/

#eval (λ x : Nat => x + 5) 10

/-
別の式から関数を作成することは、ラムダ抽象化として知られるプロセスです。
変数 x : α を持ち、式 t : β を構築できると仮定すると、
式 fun (x : α) => t、すなわち λ (x : α) => t は、型 α → β のオブジェクトです。
これを、任意の値 x を値 t に写す α から β への関数と考えてください。

以下は、さらにいくつかの例です。
-/

#check fun x : Nat => fun y : Bool => if not y then x + 1 else x + 2
#check fun (x : Nat) (y : Bool) => if not y then x + 1 else x + 2
#check fun x y => if not y then x + 1 else x + 2

/-
Lean は最後の 3 つの例を同じ式として解釈します；最後の式では、Lean は式から x と y の型を推論します。
y でない場合は x + 1、そうでなければ x + 2 です。

関数の操作に関するいくつかの数学的に一般的な例は、ラムダ抽象を用いて記述できます。
-/

def f (n : Nat) : String := toString n
def g (s : String) : Bool := s.length > 0

#check fun x : Nat => x
#check fun x : Nat => true
#check fun x : Nat => g (f x)
#check fun x => g (f x)

/-
これらの表現が何を意味するか考えてみてください。
式 fun x : Nat => x は Nat 上の恒等関数を表し、
式 fun x : Nat => true は常に true を返す定数関数を示し、
fun x : Nat => g (f x) は f と g の合成を表します。
一般的に、型注釈は除外し、Lean に推測させることができます。
例えば、fun x => g (f x) を fun x の代わりに書くことができます：Nat => g (f x)。

関数をパラメータとして渡すことができ、f と g という名前を付けることで、
実装でそれらの関数を使用できます。
-/

#check fun (g : String → Bool) (f : Nat → String) (x : Nat) => g (f x)

/-
型をパラメータとして渡すこともできます。-/

#check fun (α β γ : Type) (g : β → γ) (f : α → β) (x : α) => g (f x)

/-
たとえば、最後の式は、α、β、γ の3つの型と、g : β → γ と f: α → β の2つの関数を取る関数を示し、
g と f の組成を返します。（この関数の種類を理解するには、従属製品の理解が必要であり、以下で説明します。）

ラムダ式の一般形は fun (x : α) => t であり、ここで変数 x は「束縛変数」であり、実際にはプレースホルダーであり、
その「スコープ」は式 t を超えません。例えば、式 fun (b : β) (x : α) => b の変数 b は、以前に宣言した定数 b とは無関係です。
実際、この式は fun (u : β) (z : α) => u と同じ関数を示します。

形式的には、束縛変数のリネームまで同一である式はアルファ等価と呼ばれ、「同一」とみなされます。
Leanはこの等価性を認識しています。

項 t : α → β を項 s : α に適用すると、式 t s : β が得られることにご注意ください。
前の例に戻り、明確さのためにバインド変数の名前を変更し、以下の式の型にご留意ください。
-/

#check (fun x : Nat => x) 1
#check (fun x : Nat => true) 1

def ff (n : Nat) : String := toString n
def gg (s : String) : Bool := s.length > 0

#check
  (fun (α β γ : Type) (u : β → γ) (v : α → β) (x : α) => u (v x)) Nat String Bool g f 0

/-
予想通り、式 (fun x : Nat => x) 1 は Nat 型です。
実際には、もっと当てはまるべきです：式 (fun x : Nat => x) を 1 に適用すれば、値 1 を「返す」はずです。
そして、実際にそうです：-/

#eval (fun x : Nat => x) 1
#eval (fun x : Nat => true) 1

/-
後ほど、これらの用語がどのように評価されるかをご覧いただけます。現時点では、これは従属型理論の重要な特徴であることに留意してください。
すべての項は計算的挙動を持ち、正規化の概念を支持しています。原則として、同じ値に還元される二つの項は定義上等しいと呼ばれます。
Lean の型チェッカーではそれらは「同一」と見なされており、Lean はこれらの識別を認識し支援するよう最善を尽くしています。

Leanは完全なプログラミング言語です。バイナリ実行ファイルを生成するコンパイラとインタラクティブインタプリタを備えています。
式を実行するには #eval コマンドを使用でき、関数のテストに推奨される方法です。
-/
