/-

2.従属型理論🔗

依存型理論は、強力で表現力豊かな言語であり、
複雑な数学的主張を表現し、複雑なハードウェア
およびソフトウェアの仕様を作成し、これら両方に
ついて自然かつ統一的に考察することができます。
リーンは、構成計算と呼ばれる従属型理論のバージョン
に基づいており、非累積的宇宙と帰納型の可算階層を
備えています。この章の終わりまでに、これが何を意味
するかの多くをご理解いただけるでしょう。


2.1.単純型理論

“Type theory”は、すべての式が対応する型を
持つという事実に由来して名付けられました。
例えば、ある文脈において、x + 0 は自然数を表す
ことができ、f は自然数上の関数を表すことがあります。
正確な定義を求める方にとって、リーン自然数は任意精度の
符号なし整数です。

以下は、Leanでオブジェクトを宣言し、その型を確認する
方法の例です。

-/

/- Define some constants. -/
def m : Nat := 1       -- m is a natural number
def n : Nat := 0
def b1 : Bool := true  -- b1 is a Boolean
def b2 : Bool := false

/- Check their types. -/
#check m
#check n
#check n + 0
#check m * (n + 0)
#check b1-- "&&" is the Boolean and
#check b1 && b2-- Boolean or
#check b1 || b2-- Boolean "true"
#check true/- Evaluate -/

#eval 5 * 4
#eval m + 2
#eval b1 && b2

/-

/- と -/ の間の任意のテキストは、Lean によって無視される
コメントブロックとなります。同様に、2つのハイフンは、行の残り
の部分に無視されるコメントが含まれていることを示します。
コメントブロックは入れ子にでき、多くのプログラミング言語と同様に
コードのチャンクを「コメントアウト」することが可能です。

def キーワードは、新しい定数シンボルを作業環境に宣言します。
上記の例では、def m : Nat := 1 は、値が 1 の型 Nat の新しい
定数 m を定義します。
#Check コマンドは Lean に型の報告を求めます。
Lean では、システムに情報を問い合わせる補助コマンドは通常、
ハッシュ（#）記号で始まります。
#Eval コマンドは、Lean に指定された式の評価を求めます。
定数を宣言したり、式をタイプチェックしたりしてみてください。
このように新しいオブジェクトを宣言することは、システムを実験する良い方法です。

シンプルな型理論が強力である理由は、他の型から新しい型を構築できることです。
例えば、a と b が型である場合、a → b は a から b までの関数の型を示し、
a × b は a の要素と b の要素が対になったペアの型を表し、これはデカルト積とも呼ばれます。
× は Unicode 記号であることに注意してください。
Unicode の賢明な使用は可読性を向上させ、すべての現代のエディタはそれを大いにサポートしています。
Lean標準ライブラリでは、型を示すギリシャ文字がしばしば見られ、
Unicode記号→は->のよりコンパクトな形として用いられます。

-/

#check Nat → Nat
#check Nat -> Nat
#check Nat × Nat
#check Prod Nat Nat
#check Nat → Nat → Nat
#check Nat → (Nat → Nat)
#check Nat × Nat → Nat
#check (Nat → Nat) → Nat

#check Nat.succ
#check (0, 1)
#check Nat.add
#check Nat.succ 2
#check Nat.add 3
#check Nat.add 5 2
#check (5, 9).1
#check (5, 9).2
#eval Nat.succ 2
#eval Nat.add 5 2
#eval (5, 9).1
#eval (5, 9).2


/-

改めて、ご自身でいくつかの例を試してみてください。

基本的な構文をいくつか見てみましょう。
Unicode の矢印 → は、\to または \r または \-> と
入力することで入力できます。
ASCII の代替語 -> を使用することもできますので、
Nat -> Nat と Nat → Nat という表現は同じ意味です。
両方の式は、自然数を入力として受け取り、
自然数を出力として返す関数の種類を示します。
Unicode 記号 × のデカルト積は \times として入力されます。
一般的に、α、β、γ などの小文字のギリシャ文字を使用し、
型に対して範囲を測ります。
これらの特定のものは \a、\b、\g で入力できます。

ここには、さらにいくつか注意すべきことがあります。
まず、関数 f を値 x に適用することは f x として現れます（例：Nat.succ 2）。
第二に、型式を記述する際、矢印は右側に関連付けられます。
例えば、Nat.add の型は Nat → Nat → Nat であり、
これは Nat → (Nat → Nat) に相当します。
したがって、Nat.add は自然数を取り、自然数を返す別の関数として見ることができます。
型理論では、これは一般に、自然数のペアを入力として受け取り、出力として自然数を返す関数として
Nat.add を書くよりも便利です。例えば、Nat.add 関数を「部分的に適用」することができます。
上記の例は、Nat.add 3 の型が Nat → Nat であることを示しています。
すなわち、Nat.add 3 は第2引数 n を「待機」する関数を返し、
これは Nat.add 3 n の記述と同等です。

ご覧のとおり、m : Nat と n : Nat がある場合、(m, n) は m と n の順序対で、
型は Nat × Nat です。これにより、自然数のペアを作成する方法が得られます。
逆に、p : Nat × Nat の場合、p.1 を Nat と、p.2 を Nat と書くことができます。
これにより、その2つの成分を抽出する方法が得られます。

-/
