/-

2.6.変数とセクション

以下の3つの関数定義を検討してください。
-/

def compose (α β γ : Type) (g : β → γ) (f : α → β) (x : α) : γ :=
  g (f x)

def doTwice (α : Type) (h : α → α) (x : α) : α :=
  h (h x)

def doThrice (α : Type) (h : α → α) (x : α) : α :=
  h (h (h x))

/-
Lean は、これらの宣言をよりコンパクトに見せるための変数コマンドを提供します：
-/

variable (α β γ : Type)

def compose_1 (g : β → γ) (f : α → β) (x : α) : γ :=
  g (f x)

def doTwice_1 (h : α → α) (x : α) : α :=
  h (h x)

def doThrice_1 (h : α → α) (x : α) : α :=
  h (h (h x))

/-
任意の型の変数を宣言できます。型そのものだけでなく：
-/

variable (α β γ : Type)
variable (g : β → γ) (f : α → β) (h : α → α)
variable (x : α)

def compose_2 := g (f x)
def doTwice_2 := h (h x)
def doThrice_2 := h (h (h x))

#print compose
#print doTwice
#print doThrice

/-
それらを印刷すると、3つの定義群すべてが全く同じ効果を持つことが示されています。

変数コマンドは、Lean に対し、宣言された変数を名前で参照する定義にバインド変数として挿入するよう指示します。
Leanは、定義においてどの変数が明示的または暗黙的に使用されているかを把握できるほど賢いです。
したがって、定義を書く際には、α、β、γ、g、f、h、x を固定された対象として記述し、Lean に自動的に定義を抽象化させることができます。

このように宣言した場合、変数は作業中のファイルの末尾までスコープ内に残ります。
しかしながら、時には変数の範囲を制限することが有用です。
その目的のために、Lean はセクションの概念を提供します。
-/

section useful
  variable (α β γ : Type)
  variable (g : β → γ) (f : α → β) (h : α → α)
  variable (x : α)

  def compose_4 := g (f x)
  def doTwice_4 := h (h x)
  def doThrice_4 := h (h (h x))
end useful

/-
セクションが閉じられると、変数はスコープ外となり、参照できなくなる。

セクション内の行をインデントする必要はありません。セクションに名前を付ける必要はありません。
すなわち、匿名のセクション/エンドペアを使用できます。
ただし、セクションに名前を付ける場合は、同じ名前で閉じる必要があります。
セクションは入れ子にすることもでき、新しい変数を段階的に宣言することができます。

-/
