/-

2.8.従属型理論は何が依存性をもたらすのでしょうか？

簡潔な説明ですが、型はパラメータに依存することがあります。すでにこの素晴らしい例をご覧になったことがあります。
型 List α は引数 α に依存し、この依存性が List Nat と List Bool を区別する要素です。別の例として、ベクトル α n という型を考えてみましょう。
α の長さ n の要素のベクトルの型です。この型は、ベクトル中の要素のタイプ（α：タイプ）とベクトル n：Nat の長さという2つのパラメータに依存します。

たとえば、リストの先頭に新しい要素を挿入する関数 cons を書きたいとします。コンスはどのタイプにすべきですか？
このような関数は多型であり、Nat、Bool、または任意の型αに対するcons関数も同様に動作することが期待されます。
したがって、型を cons の最初の引数とするのは理にかなっており、任意の型 α に対して cons α は型 α のリストの挿入関数となります。
言い換えれば、すべての α に対して cons α は要素 a : α とリストを : List α として取り、新しいリストを返す関数であり、したがって cons α a を : List α として持つことができます。

Cons α は型 α → List α → List α を持つべきであることは明らかです。しかし、どのタイプのconsを持つべきでしょうか？最初の推測は Type → α → List α → List α かもしれませんが、よく考えてみると意味が通りません。この式の α は何も指しているわけではなく、むしろ Type 型の引数を指すべきです。
言い換えれば、α : Type を関数の最初の引数と仮定すると、次の 2 要素の型は α と List α です。これらのタイプは、最初の引数であるαによって異なります。

-/

def cons (α : Type) (a : α) (as : List α) : List α :=
  List.cons a as

#check cons Nat
#check cons Bool
#check cons

/-
これは従属関数型、または従属矢印型のインスタンスです。Α : 型 と β : α → 型 が与えられたとき、β を α より上の型の族と考えてください。すなわち、各 a : α に対する型 β a です。
その場合、型 (a : α) → β a は関数 f の型を示し、各 a : α に対して f a が β a の要素であるという性質を持ちます。言い換えれば、f が返す値の型はその入力に依存します。

(A : α) → β は、任意の式 β : Type に対して意味があることに注意してください。Β の値が a に依存する場合（例えば、前段落の式 β a のように）、(a : α) → β は従属関数型を示します。
Β が a に依存しないとき、(a : α) → β は α → β の型と変わりません。実際、従属型理論（およびリーン）において、α → β は β が a に依存しない場合、(a : α) → β の表記にすぎません。

リストの例に戻りますと、#check コマンドを使用して、以下の List 関数の型を確認できます。@記号と丸括弧と波括弧の違いについて、一時的に説明いたします。
-/

#check @List.cons
#check @List.nil
#check @List.length
#check @List.append

/-
従属関数型 (a : α) → β a が関数型 α → β の概念を一般化し、β が a に依存することを許すのと同様に、従属的デカルト積型 (a : α) × β a も同様にデカルト積 α × β を一般化します。
従属性はシグマ型とも呼ばれ、Σ a : α, β a と書くこともできます。⟨A, b⟩ または Sigma.mk a b を使用して、従属ペアを作成できます。
⟨ と ⟩ の文字は、それぞれ \langle と \rangle、または \< と \> で入力できます。
-/

universe u v

def f (α : Type u) (β : α → Type v) (a : α) (b : β a) : (a : α) × β a :=
  ⟨a, b⟩

def g (α : Type u) (β : α → Type v) (a : α) (b : β a) : Σ a : α, β a :=
  Sigma.mk a b

def h1 (x : Nat) : Nat :=
  (f Type (fun α => α) Nat x).2

#eval h1 5

def h2 (x : Nat) : Nat :=
  (g Type (fun α => α) Nat x).2

#eval h2 5

/-
上記の関数 f と g は同じ関数を表します。
-/
