/-

2.4.定義

Def キーワードは、新しい名前付きオブジェクトを宣言する重要な方法の一つを提供していることを覚えておいてください。

-/

def double (x : Nat) : Nat :=
  x + x

/-
他のプログラミング言語における関数の動作をご存知であれば、こちらの方がより馴染みやすくなるかもしれません。
Doubleという名前は、入力パラメータ x を Nat 型で返す関数として定義されており、呼び出しの結果が x + x であるため、Nat 型を返します。
その後、この関数は次の方法で呼び出すことができます：
-/

#eval double 3

/-
この場合、def は一種の名前が付いた楽しさと考えることができます。
以下は同じ結果です。-/

def double_fun : Nat → Nat :=
  fun x => x + x

#eval double_fun 3

/-
Lean が推測できる十分な情報を持っている場合、型宣言を省略することができます。
型推論はリーンの重要な要素です：-/

def double_wo_type :=
  fun (x : Nat) => x + x

/-
定義の一般的な形は def foo : α := bar であり、ここで α は式 bar から返される型です。
Leanは通常、α型を推測できますが、明示的に記述することがしばしば良い考えです。
これにより意図が明確になり、Lean は定義の右側に一致するタイプが存在しない場合、エラーをフラグ付けします。

右側バーは、ラムダだけでなく、任意の表現にすることができます。したがって、def はこのように単に値に名前を付けるためにも使用できます。
-/

def pi := 3.141592654

/-
def は複数の入力パラメータを受け取ることができます。自然数を2つ加えるものを作りましょう：
-/

def add (x y : Nat) :=
  x + y

#eval add 3 2

/-
パラメータリストは次のように区切ることができます。
-/

def add_p (x : Nat) (y : Nat) :=
  x + y

#eval add_p (double 3) (7 + 9)

/-
ご注意ください、ここでは最初の追加パラメータを作成するために double 関数を呼び出しました。

def 内で、他のより興味深い表現を使用できます。
-/

def greater (x y : Nat) :=
  if x > y then x
  else y

/-
このものが何をするか、おそらく推測できるでしょう。

別の関数を入力として受け取り、関数を定義することもできます。
以下は、指定された関数を2回呼び出し、最初の呼び出しの出力を2番目の呼び出しに渡します。
-/

def doTwice (f : Nat → Nat) (x : Nat) : Nat :=
  f (f x)

#eval doTwice double 2

/-
もう少し抽象的にするために、型パラメータのような引数を指定することもできます。
-/

def compose (α β γ : Type) (g : β → γ) (f : α → β) (x : α) : γ :=
  g (f x)

/-
これは、compose が任意の二つの関数を入力引数として受け取る関数であり、各関数がそれぞれ 1 つの入力のみを受け取ることを意味します。
型代数 β → γ と α → β は、第二の関数の出力の型が第一の関数の入力の型と一致しなければならないという要件を意味します。
これは理にかなっています。そうでなければ、二つの関数は組立できません。

Compose は、型 α の第3引数も受け取り、これを使用して第2の関数（ローカル名は f）を呼び出し、
その関数（型は β）の結果を最初の関数（ローカル名は g）に入力として渡します。
最初の関数は γ 型を返すため、これはコンポーズ関数の戻り型でもあります。

コンポーズは、任意のタイプ α β γ に対して機能する点で、非常に一般的です。
これは、compose がそれぞれ 1 つのパラメータを持ち、かつ 2 番目の関数の出力タイプが最初の関数の入力と一致している限り、
ほぼ任意の 2 つの関数をコンパドルできることを意味します。例えば：
-/

def square (x : Nat) : Nat :=
  x * x

#eval compose Nat Nat Nat double square 3
