/-

1.はじめに

1.1.コンピュータと定理の証明

形式的検証は、論理的および計算的手法を用いて、
正確な数学的用語で表現された主張を確立することを含みます。
これらには、一般的な数学的定理や、ハードウェアやソフトウェア、
ネットワークプロトコル、機械的およびハイブリッドシステムが
それぞれの仕様を満たすという主張が含まれることがあります。
実際には、数学の検証とシステムの正確性の検証に明確な区別はありません。
形式的な検証はハードウェアおよびソフトウェアシステムを数学的用語で記述
することが必要であり、その時点でそれらの正しさに関する主張を確立することは、
定理証明の一形態となります。逆に、数学的定理の証明には長時間の計算が必要に
なることがあり、その場合、その定理の真偽を検証するには、計算が本来すべきことを
実行していることを検証する必要があります。

数学的主張を裏付ける金標準は証明を提供することであり、
20世紀の論理学の発展は、従来の証明手法のほとんど、すなわちすべてが、いくつかの基礎体系の
いずれかにおいて、少数の公理や規則に還元できることを示しています。
この削減により、コンピュータが主張を確立する方法は二つあり、
まず証拠を見つける手助けをし、そして主張された証拠が正しいことを検証することができます。

自動定理証明は「探索」の側面に焦点を当てます。
解決定理証明器、表定理証明器、高速満足性ソルバー等は、命題論理および一次論理における
式の妥当性を確立する手段を提供します。他のシステムは、整数や実数に対する線形式や非線形式など、
特定の言語や領域に対する検索手順や決定手順を提供します。
SMT（「satisfiability modulo theories」）のようなアーキテクチャは、ドメイン汎用検索手法と
ドメイン固有の手順を組み合わせています。コンピュータ代数システムおよび専門的な数学ソフトウェアパッケージは、
数学的計算の実施、数学的境界の設定、または数学的対象物の探索手段を提供します。
計算は証明としても見なすことができ、これらのシステムも数学的主張を確立するのに役立ちます。

自動推論システムは、しばしば保証された健全性を犠牲にして、力と効率性を追求します。
このようなシステムにはバグがあることがあり、提供する結果が正確であることを保証するのは難しいことがあります。
対照的に、インタラクティブ定理証明は、定理証明の「検証」側面に焦点を当て、すべての主張が適切な公理的根拠に
基づく証明によって裏付けられることを要求します。これは非常に高い基準を設定します：推論のすべての規則や計算の
すべての段階は、基本的な公理や規則まで、先行する定義や定理に訴えて正当化しなければなりません。
実際、ほとんどのそのようなシステムは、他のシステムに伝えることができ、独立して確認できる、
完全に精緻化された「証明オブジェクト」を提供します。このような証明を構築するには、通常、ユーザーからのはるかに
多くの入力と操作が必要ですが、より深く、より複雑な証明を得ることができます。

Lean Theorem Proverは、インタラクティブと自動定理証明のギャップを埋めることを目的とし、
ユーザーインタラクションと完全に指定された公理的証明の構築を支援するフレームワークに自動化ツールと手法を配置します。
目的は、数学的推論と複雑系に関する推論の両方を支援し、両方の領域における主張を検証することです。

Lean の根底にある論理は計算的解釈を持ち、Lean はプログラミング言語としても同様に見なすことができます。
より具体的に言えば、それは正確な意味論を持つプログラムを書くためのシステムであり、プログラムが計算する関数についての
推論も含んでいます。Leanは独自のメタプログラミング言語として機能する仕組みも備えており、これによりLean自体を使用して
自動化を実装し、Leanの機能を拡張することができます。リーンのこれらの側面は、無料のオンライン書籍『Functional Programming in Lean』
で説明されていますが、システムの計算的側面がここに登場します。

-/

/-

1.2.Leanについて

Leanプロジェクトは、2013年にMicrosoft Research RedmondでLeonardo de Mouraによって開始されました。
これは継続的かつ長期的な取り組みであり、オートメーションの可能性の多くは時間の経過とともに徐々に実現されるでしょう。
LeanはApache 2.0ライセンスの下でリリースされており、これは他者がコードや数学ライブラリを自由に使用・拡張できる
許容的なオープンソースライセンスです。

Lean をコンピュータにインストールするには、クイックスタートの手順の使用をご検討ください。
Lean のソースコードおよび Lean 構築の手順は、https://github.com/leanprover/lean4/ で入手可能です。

このチュートリアルでは、Lean 4 と呼ばれる現在の Lean バージョンについて説明します。

-/

/-

1.3.この本について

本書は、リーンにおける証明を開発し、検証する方法を教えることを目的としています。
これを行うために必要な背景情報の多くは、Lean に特化したものではありません。
まず、Lean が基づく論理体系を学びます。これは、ほぼすべての従来の数学的定理を証明できるほど強力で、
自然な方法で実行できるほど表現力のある従属型理論のバージョンです。
より具体的には、リーンは帰納型を用いた構文計算と呼ばれるシステムのバージョンに基づいています。
リーンは、依存型理論において数学的対象を定義し、数学的主張を表現できるだけでなく、証明を書く言語としても利用できます。

完全に詳細な公理的証明は非常に複雑であるため、定理証明の課題は、コンピュータにできるだけ多くの詳細を埋めさせることです。
依存型理論においてこれを支えるさまざまな方法を学びます。例えば、用語の書き換えや、Lean の自動化手法を用いて用語や表現を自動的に簡略化します。
同様に、柔軟な代数的推論の形態を支えるために利用できる、精緻化および型推論の手法です。

最後に、リーン固有の機能について学びます。
システムと通信するために使用する言語や、複雑な理論やデータを管理するためにリーンが提供する仕組みが含まれます。

テキスト全体を通じて、以下のようなリーンコードの例が掲載されています。

-/

theorem and_commutative (p q : Prop) : p ∧ q → q ∧ p :=
  fun hpq : p ∧ q =>
  have hp : p := And.left hpq
  have hq : q := And.right hpq
  show q ∧ p from And.intro hq hp

/-

この本のすべてのコード例の横には、「Copy to clipboard」というボタンが表示されます。
ボタンを押すと、コードを正しくコンパイルできる十分なコンテキストを含むサンプルがコピーされます。
例のコードを VS Code に貼り付けて例を変更すれば、Lean が結果を確認し、入力中に継続的にフィードバックを提供します。
次の章に取り組む際に、ご自身で例を実行し、コードを試すことをお勧めいたします。
この書籍は、VS Codeで「Lean 4: Docs: Show Documentation Resources」コマンドを使用し、開くタブで「Theorem Proving in Lean 4」
を選択することで開くことができます。

-/

/-

1.4.謝辞

このチュートリアルは、GitHubで維持されているオープンアクセスプロジェクトです。多くの方々が取り組みに貢献し、訂正や提案、例、テキストをご提供くださいました。
ウルリック・ブッホルツ、ケビン・バザード、マリオ・カルネイロ、ネイサン・カーター、エドゥアルド・カヴァゾス、アミン・チャイエブ、ジョー・コーネリ、ウィリアム・デメオ、
マーカス・クラアス・デ・ヴリース、ベン・ダイアー、ガブリエル・エブナー、アンソニー・ハート、サイモン・ヒュードン、ショーン・レザー、アッシア・マフービ、ギハン・マラシンガ、
パトリック・マッソー、クリストファー・ジョン・メイジー、セバスチャン・ウルリッヒ、フロリス・ヴァン・ドーン、ダニエル・ヴェレマン、テオ・ジマーマン、ポール・チショルム、
クリス・ロベット、シッダールタ・ガドギルの皆様のご貢献に感謝いたします。
最新の素晴らしい貢献者リストについては、lean prover と lean community をご覧ください。

-/
