/-

2.従属型理論🔗

依存型理論は、強力で表現力豊かな言語であり、
複雑な数学的主張を表現し、複雑なハードウェア
およびソフトウェアの仕様を作成し、これら両方に
ついて自然かつ統一的に考察することができます。
リーンは、構成計算と呼ばれる従属型理論のバージョン
に基づいており、非累積的宇宙と帰納型の可算階層を
備えています。この章の終わりまでに、これが何を意味
するかの多くをご理解いただけるでしょう。


2.1.単純型理論

“Type theory”は、すべての式が対応する型を
持つという事実に由来して名付けられました。
例えば、ある文脈において、x + 0 は自然数を表す
ことができ、f は自然数上の関数を表すことがあります。
正確な定義を求める方にとって、リーン自然数は任意精度の
符号なし整数です。

以下は、Leanでオブジェクトを宣言し、その型を確認する
方法の例です。

-/

/- Define some constants. -/
def m : Nat := 1       -- m is a natural number
def n : Nat := 0
def b1 : Bool := true  -- b1 is a Boolean
def b2 : Bool := false

/- Check their types. -/
#check m
#check n
#check n + 0
#check m * (n + 0)
#check b1-- "&&" is the Boolean and
#check b1 && b2-- Boolean or
#check b1 || b2-- Boolean "true"
#check true/- Evaluate -/

#eval 5 * 4
#eval m + 2
#eval b1 && b2

/-

/- と -/ の間の任意のテキストは、Lean によって無視される
コメントブロックとなります。同様に、2つのハイフンは、行の残り
の部分に無視されるコメントが含まれていることを示します。
コメントブロックは入れ子にでき、多くのプログラミング言語と同様に
コードのチャンクを「コメントアウト」することが可能です。

def キーワードは、新しい定数シンボルを作業環境に宣言します。
上記の例では、def m : Nat := 1 は、値が 1 の型 Nat の新しい
定数 m を定義します。
#Check コマンドは Lean に型の報告を求めます。
Lean では、システムに情報を問い合わせる補助コマンドは通常、
ハッシュ（#）記号で始まります。
#Eval コマンドは、Lean に指定された式の評価を求めます。
定数を宣言したり、式をタイプチェックしたりしてみてください。
このように新しいオブジェクトを宣言することは、システムを実験する良い方法です。

シンプルな型理論が強力である理由は、他の型から新しい型を構築できることです。
例えば、a と b が型である場合、a → b は a から b までの関数の型を示し、
a × b は a の要素と b の要素が対になったペアの型を表し、これはデカルト積とも呼ばれます。
× は Unicode 記号であることに注意してください。
Unicode の賢明な使用は可読性を向上させ、すべての現代のエディタはそれを大いにサポートしています。
Lean標準ライブラリでは、型を示すギリシャ文字がしばしば見られ、
Unicode記号→は->のよりコンパクトな形として用いられます。

-/

#check Nat → Nat
#check Nat -> Nat
#check Nat × Nat
#check Prod Nat Nat
#check Nat → Nat → Nat
#check Nat → (Nat → Nat)
#check Nat × Nat → Nat
#check (Nat → Nat) → Nat

#check Nat.succ
#check (0, 1)
#check Nat.add
#check Nat.succ 2
#check Nat.add 3
#check Nat.add 5 2
#check (5, 9).1
#check (5, 9).2
#eval Nat.succ 2
#eval Nat.add 5 2
#eval (5, 9).1
#eval (5, 9).2


/-

改めて、ご自身でいくつかの例を試してみてください。

基本的な構文をいくつか見てみましょう。
Unicode の矢印 → は、\to または \r または \-> と
入力することで入力できます。
ASCII の代替語 -> を使用することもできますので、
Nat -> Nat と Nat → Nat という表現は同じ意味です。
両方の式は、自然数を入力として受け取り、
自然数を出力として返す関数の種類を示します。
Unicode 記号 × のデカルト積は \times として入力されます。
一般的に、α、β、γ などの小文字のギリシャ文字を使用し、
型に対して範囲を測ります。
これらの特定のものは \a、\b、\g で入力できます。

ここには、さらにいくつか注意すべきことがあります。
まず、関数 f を値 x に適用することは f x として現れます（例：Nat.succ 2）。
第二に、型式を記述する際、矢印は右側に関連付けられます。
例えば、Nat.add の型は Nat → Nat → Nat であり、
これは Nat → (Nat → Nat) に相当します。
したがって、Nat.add は自然数を取り、自然数を返す別の関数として見ることができます。
型理論では、これは一般に、自然数のペアを入力として受け取り、出力として自然数を返す関数として
Nat.add を書くよりも便利です。例えば、Nat.add 関数を「部分的に適用」することができます。
上記の例は、Nat.add 3 の型が Nat → Nat であることを示しています。
すなわち、Nat.add 3 は第2引数 n を「待機」する関数を返し、
これは Nat.add 3 n の記述と同等です。

ご覧のとおり、m : Nat と n : Nat がある場合、(m, n) は m と n の順序対で、
型は Nat × Nat です。これにより、自然数のペアを作成する方法が得られます。
逆に、p : Nat × Nat の場合、p.1 を Nat と、p.2 を Nat と書くことができます。
これにより、その2つの成分を抽出する方法が得られます。

-/

/-

2.2.オブジェクトとしての型

Lean の従属型理論が単純型理論を拡張する一つの方法は、
型そのもの――ナットやブールのようなエンティティ――が第一級の市民である、
すなわち彼ら自身が対象であるということです。
そのようにするには、各々がタイプを持つ必要があります。
-/

#check Nat
#check Bool
#check Nat → Bool
#check Nat × Bool
#check Nat → Nat
#check Nat × Nat → Nat
#check Nat → Nat → Nat
#check Nat → (Nat → Nat)
#check Nat → Nat → Bool
#check (Nat → Nat) → Nat

/-
上記の各式は Type 型のオブジェクトであることが確認できます。
型に対して新しい定数を宣言することもできます。
-/

def α : Type := Nat
def β : Type := Bool
def F : Type → Type := List
def G : Type → Type → Type := Prod

#check α
#check F α
#check F Nat
#check G α
#check G α β
#check G α Nat

/-
上記の例が示すように、Type → Type → Type 型の関数、
すなわちデカルト積 Prod の例をすでにご覧になっているでしょう。
-/

-- def α : Type := Nat
-- def β : Type := Bool
#check Prod α β
#check α × β
#check Prod Nat Nat
#check Nat × Nat

/-こちらは別の例です。任意の型αが与えられると、
型リストαは型αの要素のリストの型を示します。-/

-- def α : Type := Nat
#check List α
#check List Nat

/-Lean のすべての式には型があることを考えると、タイプ自体の型はどのタイプを
持つのかと問うのは自然なことです。-/

#check Type

/-実際に、Lean のタイピングシステムの最も微妙な側面の一つに出くわしました。
Lean の根底にある基盤は、無限の種類の階層を持っています：-/

#check Type
#check Type 1
#check Type 2
#check Type 3
#check Type 4

/-
タイプ0を「小さい」または「普通」なタイプの宇宙と考えてください。
タイプ1は、タイプ0を要素として含む、より大きなタイプの宇宙であり、
タイプ2は、タイプ1を要素として含む、さらに大きなタイプの宇宙です。
リストは無限です：すべての自然数 n に対してタイプ n が存在します。
Type は Type 0 の略語です。-/

#check Type
#check Type 0

/-以下の表は、議論されている関係を具体化するのに役立つかもしれません。
X軸に沿った動きは宇宙の変化を表し、y軸に沿った動きは時に「度」と呼ばれる変化を表します。-/

/-
sort
Prop (Sort 0)
Type (Sort 1)
Type 1 (Sort 2)
Type 2 (Sort 3)
...
type
True
Bool
Nat -> Type
Type -> Type 1
...
term
True.intro
true
fun n => Fin n
fun (_ : Type) => Type
...
-/

/-しかしながら、いくつかの操作は型ユニバース上で多型である必要があります。
例えば、リストαは、どのタイプの宇宙αが存在していても、任意のタイプαに対して意味があるはずです。
これは関数「List」の型シグネチャについて説明しています。-/

#check List

/-ここで u は型レベルにわたる変数です。#Check コマンドの出力は、α が Type u を持つたびに、
List α も Type u を持つことを意味します。関数 Prod は同様に多型です：-/

#check Prod

/-ポリモーフィック定数を定義するために、Lean は universe コマンドを使用して universe 変数を明示的に
宣言できるようにします。-/

--universe u
def FF (α : Type u) : Type u := Prod α α
#check FF -- F.{u} : Type u → Type u

/-F を定義する際に universe パラメータを指定することで、universe コマンドを回避できます。-/

def FFF.{u} (α : Type u) : Type u := Prod α α
#check FFF


/-

2.3.関数の抽象化と評価

Lean は、式から関数を作成するための
fun（または λ）キーワードを次のように提供します。

-/

#check fun (x : Nat) => x + 5-- λ and fun mean the same thing
#check λ (x : Nat) => x + 5

/-
この例では、型 Nat を推測できます。-/

#check fun x => x + 5
#check λ x => x + 5

/-
必要なパラメータを渡すことで、ラムダ関数を評価できます。
-/

#eval (λ x : Nat => x + 5) 10

/-
別の式から関数を作成することは、ラムダ抽象化として知られるプロセスです。
変数 x : α を持ち、式 t : β を構築できると仮定すると、
式 fun (x : α) => t、すなわち λ (x : α) => t は、型 α → β のオブジェクトです。
これを、任意の値 x を値 t に写す α から β への関数と考えてください。

以下は、さらにいくつかの例です。
-/

#check fun x : Nat => fun y : Bool => if not y then x + 1 else x + 2
#check fun (x : Nat) (y : Bool) => if not y then x + 1 else x + 2
#check fun x y => if not y then x + 1 else x + 2

/-
Lean は最後の 3 つの例を同じ式として解釈します；最後の式では、Lean は式から x と y の型を推論します。
y でない場合は x + 1、そうでなければ x + 2 です。

関数の操作に関するいくつかの数学的に一般的な例は、ラムダ抽象を用いて記述できます。
-/

def f (n : Nat) : String := toString n
def g (s : String) : Bool := s.length > 0

#check fun x : Nat => x
#check fun x : Nat => true
#check fun x : Nat => g (f x)
#check fun x => g (f x)

/-
これらの表現が何を意味するか考えてみてください。
式 fun x : Nat => x は Nat 上の恒等関数を表し、
式 fun x : Nat => true は常に true を返す定数関数を示し、
fun x : Nat => g (f x) は f と g の合成を表します。
一般的に、型注釈は除外し、Lean に推測させることができます。
例えば、fun x => g (f x) を fun x の代わりに書くことができます：Nat => g (f x)。

関数をパラメータとして渡すことができ、f と g という名前を付けることで、
実装でそれらの関数を使用できます。
-/

#check fun (g : String → Bool) (f : Nat → String) (x : Nat) => g (f x)

/-
型をパラメータとして渡すこともできます。-/

#check fun (α β γ : Type) (g : β → γ) (f : α → β) (x : α) => g (f x)

/-
たとえば、最後の式は、α、β、γ の3つの型と、g : β → γ と f: α → β の2つの関数を取る関数を示し、
g と f の組成を返します。（この関数の種類を理解するには、従属製品の理解が必要であり、以下で説明します。）

ラムダ式の一般形は fun (x : α) => t であり、ここで変数 x は「束縛変数」であり、実際にはプレースホルダーであり、
その「スコープ」は式 t を超えません。例えば、式 fun (b : β) (x : α) => b の変数 b は、以前に宣言した定数 b とは無関係です。
実際、この式は fun (u : β) (z : α) => u と同じ関数を示します。

形式的には、束縛変数のリネームまで同一である式はアルファ等価と呼ばれ、「同一」とみなされます。
Leanはこの等価性を認識しています。

項 t : α → β を項 s : α に適用すると、式 t s : β が得られることにご注意ください。
前の例に戻り、明確さのためにバインド変数の名前を変更し、以下の式の型にご留意ください。
-/

#check (fun x : Nat => x) 1
#check (fun x : Nat => true) 1

def ff (n : Nat) : String := toString n
def gg (s : String) : Bool := s.length > 0

#check
  (fun (α β γ : Type) (u : β → γ) (v : α → β) (x : α) => u (v x)) Nat String Bool g f 0

/-
予想通り、式 (fun x : Nat => x) 1 は Nat 型です。
実際には、もっと当てはまるべきです：式 (fun x : Nat => x) を 1 に適用すれば、値 1 を「返す」はずです。
そして、実際にそうです：-/

#eval (fun x : Nat => x) 1
#eval (fun x : Nat => true) 1

/-
後ほど、これらの用語がどのように評価されるかをご覧いただけます。現時点では、これは従属型理論の重要な特徴であることに留意してください。
すべての項は計算的挙動を持ち、正規化の概念を支持しています。原則として、同じ値に還元される二つの項は定義上等しいと呼ばれます。
Lean の型チェッカーではそれらは「同一」と見なされており、Lean はこれらの識別を認識し支援するよう最善を尽くしています。

Leanは完全なプログラミング言語です。バイナリ実行ファイルを生成するコンパイラとインタラクティブインタプリタを備えています。
式を実行するには #eval コマンドを使用でき、関数のテストに推奨される方法です。
-/

/-
2.4.定義🔗

Def キーワードは、新しい名前付きオブジェクトを宣言する重要な方法の一つを提供していることを覚えておいてください。

-/

def double (x : Nat) : Nat :=
  x + x

/-
他のプログラミング言語における関数の動作をご存知であれば、こちらの方がより馴染みやすくなるかもしれません。
Doubleという名前は、入力パラメータ x を Nat 型で返す関数として定義されており、呼び出しの結果が x + x であるため、Nat 型を返します。
その後、この関数は次の方法で呼び出すことができます：
-/

#eval double 3

/-
この場合、def は一種の名前が付いた楽しさと考えることができます。
以下は同じ結果です。-/

def double_fun : Nat → Nat :=
  fun x => x + x

#eval double_fun 3

/-
Lean が推測できる十分な情報を持っている場合、型宣言を省略することができます。
型推論はリーンの重要な要素です：-/

def double_wo_type :=
  fun (x : Nat) => x + x

/-
定義の一般的な形は def foo : α := bar であり、ここで α は式 bar から返される型です。
Leanは通常、α型を推測できますが、明示的に記述することがしばしば良い考えです。
これにより意図が明確になり、Lean は定義の右側に一致するタイプが存在しない場合、エラーをフラグ付けします。

右側バーは、ラムダだけでなく、任意の表現にすることができます。したがって、def はこのように単に値に名前を付けるためにも使用できます。
-/

def pi := 3.141592654

/-
def は複数の入力パラメータを受け取ることができます。自然数を2つ加えるものを作りましょう：
-/

def add (x y : Nat) :=
  x + y

#eval add 3 2

/-
パラメータリストは次のように区切ることができます。
-/

def add_p (x : Nat) (y : Nat) :=
  x + y

#eval add_p (double 3) (7 + 9)

/-
ご注意ください、ここでは最初の追加パラメータを作成するために double 関数を呼び出しました。

def 内で、他のより興味深い表現を使用できます。
-/

def greater (x y : Nat) :=
  if x > y then x
  else y

/-
このものが何をするか、おそらく推測できるでしょう。

別の関数を入力として受け取り、関数を定義することもできます。
以下は、指定された関数を2回呼び出し、最初の呼び出しの出力を2番目の呼び出しに渡します。
-/

def doTwice (f : Nat → Nat) (x : Nat) : Nat :=
  f (f x)

#eval doTwice double 2

/-
もう少し抽象的にするために、型パラメータのような引数を指定することもできます。
-/

def compose (α β γ : Type) (g : β → γ) (f : α → β) (x : α) : γ :=
  g (f x)

/-
これは、compose が任意の二つの関数を入力引数として受け取る関数であり、各関数がそれぞれ 1 つの入力のみを受け取ることを意味します。
型代数 β → γ と α → β は、第二の関数の出力の型が第一の関数の入力の型と一致しなければならないという要件を意味します。
これは理にかなっています。そうでなければ、二つの関数は組立できません。

Compose は、型 α の第3引数も受け取り、これを使用して第2の関数（ローカル名は f）を呼び出し、
その関数（型は β）の結果を最初の関数（ローカル名は g）に入力として渡します。
最初の関数は γ 型を返すため、これはコンポーズ関数の戻り型でもあります。

コンポーズは、任意のタイプ α β γ に対して機能する点で、非常に一般的です。
これは、compose がそれぞれ 1 つのパラメータを持ち、かつ 2 番目の関数の出力タイプが最初の関数の入力と一致している限り、
ほぼ任意の 2 つの関数をコンパドルできることを意味します。例えば：
-/

def square (x : Nat) : Nat :=
  x * x

#eval compose Nat Nat Nat double square 3


/-

2.5.ローカル定義🔗

Lean は、let キーワードを使用して「local」な定義を導入することも可能です。
式 let a := t1; t2 は、t2 における a のすべての出現を t1 に置き換えた結果と定義上等しい。
-/

#check let y := 2 + 2; y * y
#eval  let y := 2 + 2; y * y

def twice_double (x : Nat) : Nat :=
  let y := x + x; y * y

#eval twice_double 2

/-

ここでは、twice_double x は定義上、項 (x + x) * (x + x) と等しいです。

Let 文を連鎖させることで、複数の代入を組み合わせることができます。
-/

#check let y := 2 + 2; let z := y + y; z * z
#eval  let y := 2 + 2; let z := y + y; z * z

/-
改行が使用された場合、; は省略できます。
-/

def t (x : Nat) : Nat :=
  let y := x + x
  y * y

/-
式 let a := t1; t2 の意味が (fun a => t2) t1 の意味と非常に似ていることにご注意ください。
ただし、両者は同じではありません。最初の式では、t2 の a のすべての例を t1 の構文的略語と考えるべきです。
第2の式では、a は変数であり、式 fun a => t2 は a の値に依存せずに意味を成す必要があります。
Let構文は略語のより強い手段であり、let a := t1; t2 の形の式は (fun a => t2) t1 として表すことができません。
演習として、foo の定義が type check であるのに対し、bar の定義が行わない理由を理解しようと試みてください。
-/

def foo := let a := Nat; fun x : a => x + 2
#check foo

/-
  def bar := (fun a => fun x : a => x + 2) Nat
-/

/-
2.6.変数とセクション

以下の3つの関数定義を検討してください。
-/

def compose_1 (α β γ : Type) (g : β → γ) (f : α → β) (x : α) : γ :=
  g (f x)

def doTwice_1 (α : Type) (h : α → α) (x : α) : α :=
  h (h x)

def doThrice (α : Type) (h : α → α) (x : α) : α :=
  h (h (h x))

/-
Lean は、これらの宣言をよりコンパクトに見せるための変数コマンドを提供します：
-/

variable (α β γ : Type)

def compose_2 (g : β → γ) (f : α → β) (x : α) : γ :=
  g (f x)

def doTwice_2 (h : α → α) (x : α) : α :=
  h (h x)

def doThrice_2 (h : α → α) (x : α) : α :=
  h (h (h x))

/-
任意の型の変数を宣言できます。型そのものだけでなく：
-/

variable (α β γ : Type)
variable (g : β → γ) (f : α → β) (h : α → α)
variable (x : α)

def compose_3 := g (f x)
def doTwice_3 := h (h x)
def doThrice_3 := h (h (h x))

#print compose
#print doTwice
#print doThrice

/-
それらを印刷すると、3つの定義群すべてが全く同じ効果を持つことが示されています。

変数コマンドは、Lean に対し、宣言された変数を名前で参照する定義にバインド変数として挿入するよう指示します。
Leanは、定義においてどの変数が明示的または暗黙的に使用されているかを把握できるほど賢いです。
したがって、定義を書く際には、α、β、γ、g、f、h、x を固定された対象として記述し、Lean に自動的に定義を抽象化させることができます。

このように宣言した場合、変数は作業中のファイルの末尾までスコープ内に残ります。
しかしながら、時には変数の範囲を制限することが有用です。
その目的のために、Lean はセクションの概念を提供します。
-/

section useful
  variable (α β γ : Type)
  variable (g : β → γ) (f : α → β) (h : α → α)
  variable (x : α)

  def compose_4 := g (f x)
  def doTwice_4 := h (h x)
  def doThrice_4 := h (h (h x))
end useful

/-
セクションが閉じられると、変数はスコープ外となり、参照できなくなる。

セクション内の行をインデントする必要はありません。セクションに名前を付ける必要はありません。
すなわち、匿名のセクション/エンドペアを使用できます。
ただし、セクションに名前を付ける場合は、同じ名前で閉じる必要があります。
セクションは入れ子にすることもでき、新しい変数を段階的に宣言することができます。

-/
