/-

3.命題と証明

今や、Leanでオブジェクトや関数を定義する方法をいくつかご覧になったでしょう。
本章では、依存型理論の言語でも数学的主張や証明の書き方について説明し始めます。

3.1.タイプとしての提案🔗

従属型理論の言語で定義されたオブジェクトに関する主張を証明するための一つの戦略は、
定義言語の上にアサーション言語と証明言語を重ね合わせることです。
しかし、このように言語を乗算する理由はありません。依存型理論は柔軟で表現力があり、
同一の一般的な枠組みで主張と証明を表現できない理由もありません。

例えば、新しい型である Prop を導入して命題を表現し、コンストラクタを導入して
他の命題から新しい命題を構築することができます。
-/

def Implies (p q : Prop) : Prop := p → q

#check And
#check Or
#check Not
#check Implies

variable (p q r : Prop)

#check And p q
#check Or (And p q) r
#check Implies (And p q) (And q p)

/-
次に、各要素 p : Prop に対して、p の証明の型に対して別の型 Proof p を導入することができます。
「公的」はそのようなタイプの定数です。
-/

structure Proof (p : Prop) : Type where
  Proof : p

#check Proof

axiom and_commut (p q : Prop) : Proof (Implies (And p q) (And q p))

variable (p q: Prop)

#check and_commut p q

/-
公理に加えて、古い証明から新しい証明を作成するための規則も必要です。
例えば、命題論理学の多くの証明体系において、我々はモーダス・ポネンスの法則を持っています：

インプリーズ p q の証明と p の証明から、q の証明が得られます。

次のように表現できます。
-/

axiom modus_ponens (p q : Prop) :
  Proof (Implies p q) → Proof p →
  Proof q

/-
命題論理における自然推論の体系は、通常、次の規則に依拠します。

P を仮説と仮定すると、q の証明があるとします。そうすれば、仮説を「キャンセル」し、
Implies p q の証明を得ることができます。

次のように表現できます。
-/

axiom implies_intro (p q : Prop) :
  (Proof p → Proof q) → Proof (Implies p q)


/-
このアプローチは、私たちに合理的な主張と証明を構築する方法を提供します。
式 t が正しい主張の証明 p であることを判定することは、単に t が型 Proof p であることを確認する問題にすぎません。

しかし、いくつかの簡略化は可能です。まず、Proof p と p 自体を混同することで、用語「Proof」を繰り返し記述することを回避できます。
言い換えれば、p が prop であるときは、p を型、すなわちその証明の型として解釈することができます。
T : p を、t が p の証明であるという主張として読むことができます。

さらに、この同定を行うと、含意の規則は、Implies p q と p → q の間を行き来できることを示しています。
言い換えれば、命題 p と q の間の含意は、p の任意の要素を q の要素に取り合う関数を持つことに相当します。
結果として、結合的インプリーズの導入は完全に冗長であり、依存型理論における通常の関数空間コンストラクタ p → q をインプリケーションの概念として使用できます。

これは『構文の微積分』で採用されているアプローチであり、したがってリーンでも採用されています。自然演繹の証明系における含意の規則が、
関数の抽象化および適用を支配する規則と正確に一致するという事実は、カリー・ハワード同型写像の一例であり、時に命題型パラダイムと呼ばれる。
実際、タイプ「Prop」は、前章で説明したタイプ階層の最下位であるソート0の構文上の砂糖です。さらに、タイプ u は Sort (u+1) の単なる統語的糖です。
Prop にはいくつかの特別な特徴がありますが、他のタイプのユニバースと同様に、矢印コンストラクタで閉じています。p q が Prop の場合、p → q : Prop となります。

命題を型として考える方法は少なくとも二つあります。論理と数学を建設的に捉える方々にとって、これは命題であることの意味を忠実に表現したものです。
命題 p はある種のデータ型を表し、すなわち証明を構成するデータの種類の仕様です。P の証明は、単に正しい型のオブジェクト t:p です。

このイデオロギーに傾いていない人々は、むしろそれを単純なコーディングのトリックと見なすことができます。各命題 p に対して、p が false のときは空であり、
たとえば p が真である場合に、単一の要素を持つ型を関連付けます。後者の場合、p に対応する型が居住されているとしましょう。たまたま、関数の適用と抽象化に関する規則は、
Prop のどの要素が居住されているかを便利に追跡するのに役立ちます。したがって、要素 t : p を構築することは、p が実際に真であることを示しています。
P の住人は「p が真であるという事実」と考えることができます。P → q の証明は「p が真であるという事実」を用いて「q が真であるという事実」を得ます。

実際、p : Prop が任意の命題である場合、Lean のカーネルは任意の二つの要素 t1 t2 : p を定義上等しいものとして扱い、(fun x => t) s と t[s/x] を定義上等しいと扱うのと同様です。
これは証明無関係として知られており、最後の段落の解釈と一致しています。それは、証明 t : p を従属型理論の言語で普通の対象として扱うことができても、p が真であるという事実以外の情報は持ちません。

私たちが提案した、命題をタイプとして考えるパラダイムに関する二つの方法は、根本的に異なります。構成的観点から見ると、証明は従属型理論において適切な式で表される抽象的な数学的対象です。
対照的に、上記で説明したコーディング手法の観点から考えると、その表現自体は興味深いものを示すものではありません。むしろ、私たちがそれらを書き留め、正しくタイプされているか確認できるという事実が、
問題となっている命題が正しいことを保証します。言い換えれば、表現自体が証明です。

以下の説明では、これら二つの話し方を行き来します。時には、ある表現が命題の証明を「構築」または「生産」または「返す」と述べ、別の時には単にそれが「そのような証明である」と言うだけです。
これは、コンピュータ科学者が時折、構文と意味論の区別を曖昧にし、時にはプログラムがある関数を「計算する」と言い、また別の時にはプログラムが問題の関数であるかのように語る方法に似ています。

いずれにせよ、本当に重要なのは最終的な利益です。従属型理論の言語で数学的主張を正式に表現するには、項 p : Prop を示す必要があります。その主張を証明するためには、項 t : p を示す必要があります。
Lean の証明アシスタントとしての任務は、そのような項 t を構築するのを支援し、その項が適切に形成され、正しい型であることを確認することです。
-/
