/-

3.4.補助サブゴールの導入

これは、Lean が長い証明を構築するために提供する別の手法、すなわち「have」構成概念を紹介するのに適した場所です。
この構造は、証明に補助的なサブゴールを導入します。こちらは、最後のセクションから改変した小さな例です。

-/

variable (p q : Prop)

example (h : p ∧ q) : q ∧ p :=
  have hp : p := h.left
  have hq : q := h.right
  show q ∧ p from And.intro hq hp

/-
内部的に、式は h : p := s を持ち、t は項 (fun (h : p) => t) s を生成します。
言い換えれば、s は p の証明であり、t は h : p を仮定した望ましい結論の証明であり、
両者はラムダの抽象化と応用によって結合されます。このシンプルな装置は、長い証明を構築する際に非常に有用です。
なぜなら、中間の「have」を最終目標への踏み台として活用できるからです。

リーンは、目標から逆算する構造的な推論方法も支援し、通常の数学における「suffices to show」構成をモデル化しています。
次の例は、前の証明の最後の2行を単に置換します。
-/

variable (p q : Prop)

example (h : p ∧ q) : q ∧ p :=
  have hp : p := h.left
  suffices hq : q from And.intro hq hp
  show q from And.right h

/-
書くだけで十分です hq : q は私たちに二つの目標を残します。まず、q ∧ p の元の目的を追加の仮説 hq : q で証明することにより、
実際に q を示すだけで十分であることを示す必要があります。最後に、q を表示しなければなりません。
-/
