/-

3.5.古典的論理

これまでに見てきた導入と除去の規則はすべて構成的であり、すなわち、命題を型として持つ対応に基づく論理的結合の計算的理解を反映しています。
通常の古典論理は、これに除外された中間の法則 p ∨ ¬p を加えます。この原理を使用するには、クラシック名前空間を開く必要があります。

-/

open Classical

variable (p : Prop)

#check em p

/-
直感的に、構成的な「OR」は非常に強力です：p ∨ q を主張することは、どちらが当てはるかを知ることに等しいです。もし RH がリーマン仮説を表すのであれば、
古典的数学者は RH ∨ ¬RH を主張しようとしますが、まだどちらの離散も主張できません。

除外された中間の法則の結果の一つは、二重否定除去の原理です：

-/

theorem dne {p : Prop} (h : ¬¬ p) : p :=
  Or.elim (em p)
    (fun hp : p => hp)
    (fun hnp : ¬ p => absurd hnp h)

/-
二重否定除去法は、任意の命題 p を ¬p と仮定し、False を導出することにより証明できるようにします。なぜなら、それは ¬¬p を証明することに等しいからです。
言い換えれば、二重否定除去は矛盾による証明を行うことを可能にしますが、これは構成論理では一般に不可能です。演習として、逆を証明しようと試みることができます。
すなわち、em が dne から証明できることを示すことです。

古典的な公理は、em に訴えることで正当化できる追加の証明パターンへのアクセスも提供します。例えば、ケースによる証明を実施することができます。
-/

--variable (p : Prop)

example (h : ¬¬ p) : p :=
  byCases
    (fun h1 : p => h1)
    (fun h1 : ¬ p => absurd h1 h)

/-
あるいは、矛盾による証明を実行することもできます。
-/

--variable (p : Prop)

example (h : ¬¬ p) : p :=
  byContradiction
    (fun h1 : ¬ p =>
      show False from h h1)

/-
建設的に考えることに慣れていない場合、古典的な推論がどこで使用されているかを理解するには時間がかかるかもしれません。以下の例では必要です。
なぜなら、建設的な観点から、p と q が両方とも真でないことを知っているからといって、どちらが偽かが必ずしも分かるわけではないからです。
-/

example (h : ¬ (p ∧ q)) : ¬ p ∨ ¬ q :=
  Or.elim (em p)
    (fun hp : p =>
      Or.inr
        (show ¬ q from
          fun hq : q =>
          h ⟨hp, hq⟩))
    (fun hp : ¬ p =>
      Or.inl hp)

/-
後ほど、構成論理において除外中間や二重否定除去といった原則が許容される状況があること、
そしてリーンはそのような文脈において、除外された中間に依存せずに古典的推論の使用を支持することがわかります。

Leanで古典的推論を支えるために用いられる公理の全リストは、Axioms and Computation で議論されています。
-/
