/-

3.2.命題を型として操作する

命題型パラダイムにおいて、→ のみを含む定理はラムダ抽象化と応用を用いて証明できます。
Leanでは、定理コマンドは新しい定理を導入します。
-/

set_option linter.unusedVariables false

variable {p : Prop}
variable {q : Prop}

theorem t1 : p → q → p := fun hp : p => fun hq : q => hp

/-

この証明を、α → β → α 型の式 fun x : α => fun y : β => x と比較してください。ここで α と β はデータ型です。
これは、型 α と β の引数 x と y をそれぞれ取り、x を返す関数を記述しています。
T1 の証明は同じ形式であり、唯一の違いは p と q が Type ではなく Prop の要素であることです。
直感的に、p → q → p の証明は p と q が真であると仮定し、最初の仮説（自明）を用いて結論 p が真であることを立証します。

定理コマンドは実際には def コマンドのバージョンであることにご留意ください。
命題と型の対応において、定理 p → q → p を証明することは、対応する型の要素を定義することと同様です。
カーネル型チェッカーでは、両者に違いはありません。

しかし、定義と定理の間にはいくつかの実用的な違いがあります。通常の状況では、定理の「定義」を展開する必要は決してありません。
証明が無関係であるため、その定理の任意の二つの証明は定義上等しいです。定理の証明が完了すれば、通常はその証明が存在することだけを知ればよく、
証明が何であるかは関係ありません。その事実を踏まえて、Lean は証明を既約可能とタグ付けし、これはパーサー（より正確にはエボレータ）に対し、
ファイルを処理する際にそれらを展開する必要は通常ないことを示す手がかりとなります。
実際、Leanは一般的に校正を並行して処理・検証でき、ある証明の正確性を評価する際に別の証明の詳細を知る必要がありません。
さらに、定義の本文で参照されるセクション変数は自動的にパラメータとして追加されますが、追加されるのは定理の型で参照される変数だけです。
これは、命題が証明される方法が、証明される命題に影響を与えるべきではないためです。

定義と同様に、#print コマンドは定理の証明を示します。

-/

#print t1

/-
ラムダ抽象 hp : p および hq : q は、t1 の証明において一時的な仮定とみなすことができることにご留意ください。
Lean は、最終項 hp の型を明示的に show ステートメントで指定することも可能です。
-/

theorem t1_1 : p → q → p :=
  fun hp : p =>
  fun hq : q =>
  show p from hp

#print t1_1

/-
このような追加情報を加えることで、証拠の明瞭さが向上し、証拠作成時の誤りを検出するのに役立ちます。
Show コマンドは型に注釈を付加するだけで、内部的には、私たちが見たすべての t1 の表示が同じ用語を生成します。

通常の定義と同様に、ラムダ抽象化された変数をコロンの左側に移動できます。
-/

theorem t1_2 (hp : p) (hq : q) : p := hp
#print t1_2

/-
定理 t1 を関数の応用としてだけ使用できます。
-/

axiom hp : p

theorem t2 : q → p := t1_2 hp

/-
公理宣言は、与えられた型の要素の存在を仮定し、論理的整合性を損なう可能性があります。
例えば、空の型 False に要素があると仮定するために使用できます。
-/

axiom unsound : False
theorem ex : 1 = 0 :=
  False.elim unsound

/-
「Axiom」を宣言する hp : p は、hp によって証明されたように、p が真であると宣言することに等しい。
定理 t1 : p → q → p を hp : p が真であるという事実に適用すると、定理 t1 hp : q → p が得られます。

定理 t1 を次のように記述できることを思い出してください。
-/

theorem t1_3 {p q : Prop} (hp : p) (hq : q) : p := hp
#print t1_3

/-
t1 の型は現在 ∀ {p q : Prop}、p → q → p です。これを「命題 p q のすべての対について、
p → q → p である」という主張として読むことができます。例えば、すべてのパラメータをコロンの右側に移動できます。
-/

theorem t1_4 : ∀ {p q : Prop}, p → q → p :=
  fun {p q : Prop} (hp : p) (hq : q) =>  hp

/-
P と q が変数として宣言されている場合、Lean はそれらを自動的に一般化します：
-/

variable {p q : Prop}

theorem t1_5 : p → q → p := fun (hp : p) (hq : q) => hp

/-
このように t1 を一般化すれば、異なる命題のペアに適用し、一般定理の異なる例を得ることができます。
-/

theorem t1_6 (p q : Prop) (hp : p) (hq: q) : p := hp

variable (p q r s : Prop)
#check t1_6 p q
#check t1_6 r s
#check t1_6 (r → s) (s → r)

variable (h : r → s)
#check t1_6 (r → s) (s → r) h

/-
再び、命題型対応を用いると、型 r → s の変数 h は、r → s が成り立つという仮説、すなわち前提とみなすことができます。

別の例として、前章で議論された合成関数を、型ではなく命題を用いて考えてみましょう。
-/

variable (p q r s : Prop)

theorem t2_1 (h₁ : q → r) (h₂ : p → q) : p → r :=
  fun h₃ : p =>
  show r from h₁ (h₂ h₃)

/-
命題論理の定理として、t2 は何と述べますか？

この例で行ったように、仮定には \0, \1, \2, ... として入力された数値 Unicode の添字を使用することがしばしば有用であることにご留意ください。
-/

#check t2_1
