/-

4.1.普遍的量子化器

Α が任意の型である場合、α 上の一次述語 p を α → Prop 型のオブジェクトとして表現できることに注意してください。
その場合、x : α が与えられた場合、p x は p が x を成り立たという主張を表します。
同様に、対象 r : α → α → Prop は α 上の二項関係を示し、x y : α が与えられた場合、r x y は x が y と関係しているという主張を示します。

普遍量化子である ∀ x : α, p x は、「すべての x に対して α, p x」が成り立つという主張を表すとされています。
命題結合詞と同様に、自然演繹の体系において、「forall」は導入と除去の規則によって支配されます。
非公式に、導入規則は次のように述べています：

P x の証明が与えられ、x : α が任意である文脈において、証明 ∀ x : α, p x が得られます。

除外規則は次のように述べています：

証明 ∀ x : α, p x と任意の項 t : α が与えられたとき、p t の証明が得られます。

暗示としてそうであったように、命題をタイプとして解釈することが現在、作用しています。従属矢印タイプの導入規則と除外規則を覚えておいてください。

型 β x の項 t が与えられ、x : α が任意である文脈において、(fun x : α => t) : (x : α) → β x が成り立つ。

除外規則は次のように述べています：

項 s : (x : α) → β x と任意の項 t : α が与えられたとき、s t : β t を持ちます。

P x が Prop 型である場合、(x : α) → β x を ∀ x : α, p x に置き換えると、これらは普遍量化子を含む証明を構築するための正しい規則と読むことができます。

したがって、構文の微積分は、forall式を持つ従属矢印型をこのように特定します。P が任意の式である場合、∀ x : α、p は (x : α) → p の代替表記に他ならず、
p が命題である場合、前者の方が後者よりも自然であるという考え方です。通常、式 p は x : α に依存します。
ご承知のとおり、通常の関数空間の場合、α → β を (x : α) → β の特別なケースとして解釈でき、β は x に依存しません。
同様に、命題間の含意 p → q を、式 q が x に依存しない ∀ x : p, q の特別なケースとして考えることができます。

以下は、プロポジション・アズ・タイプ対応が実践される例です。

-/

example (α : Type) (p q : α → Prop) :
    (∀ x : α, p x ∧ q x) → ∀ y : α, p y :=
  fun h : ∀ x : α, p x ∧ q x =>
  fun y : α =>
  show p y from (h y).left

/-
記法の慣例として、普遍量化子に可能な限り広い範囲を与えるため、上記の例の仮説に x 上の量化子を限定するにはかっこが必要です。
∀ y : α, p y を証明する正典的な方法は、任意の y を取り、p y を証明することです。これは導入規則です。
現在、h が ∀ x : α, p x ∧ q x であると、式 h y は型 p y ∧ q y である。これは除外規則です。左集合を取ると、望ましい結論が得られます、p y。

束縛された変数の名前変更まで異なる式は、等価であるとみなされることを覚えておいてください。例えば、仮説と結論の両方で同じ変数 x を使用し、
証明では別の変数 z によってそれをインスタンス化できたでしょう。
-/

example (α : Type) (p q : α → Prop) :
    (∀ x : α, p x ∧ q x) → ∀ x : α, p x :=
  fun h : ∀ x : α, p x ∧ q x =>
  fun z : α =>
  show p z from And.left (h z)

/-
別の例として、関係 r が推移的であるという事実を表す方法は次のとおりです。
-/

variable (α : Type) (r : α → α → Prop)
variable (trans_r : ∀ x y z, r x y → r y z → r x z)

variable (a b c : α)
variable (hab : r a b) (hbc : r b c)

#check trans_r
#check trans_r a b c
#check trans_r a b c hab
#check trans_r a b c hab hbc

/-
ここで何が起きているのか考えてください。Trans_r を a b c の値でインスタンス化すると、r a b → r b c → r a c の証明が得られます。
これを「仮説」hab : r a b に適用すると、r b c → r a c の含意の証明が得られます。最後に、それを仮説 hbc に適用すると、結論 r a c の証明が得られます。

このような状況では、hab hbc から推測できる引数 a b c を提供することは手間がかかります。そのため、これらの議論を暗黙的にすることが一般的です。
-/

variable (α : Type) (r : α → α → Prop)
variable (trans_r : ∀ {x y z}, r x y → r y z → r x z)

variable (a b c : α)
variable (hab : r a b) (hbc : r b c)

#check trans_r
#check trans_r hab
#check trans_r hab hbc

/-
利点は、trans_r hab hbc を r a c の証明として単純に記述できることです。
欠点は、Lean が trans_r および trans_r hab の式における引数の型を推測できるだけの情報が不足していることです。
最初の #check コマンドの出力は r ですか？M.1 ?M.2 → r ?M.2 ?M.3 → r ?M.1 ?M.3 は、この場合、暗黙の引数が未指定であることを示しています。

以下は、同値関係を用いた初等推論の実施方法の例です。
-/

variable (α : Type) (r : α → α → Prop)

variable (refl_r : ∀ x, r x x)
variable (symm_r : ∀ {x y}, r x y → r y x)
variable (trans_r : ∀ {x y z}, r x y → r y z → r x z)

example (a b c d : α) (hab : r a b) (hcb : r c b) (hcd : r c d) : r a d :=
  trans_r (trans_r hab (symm_r hcb)) hcd

/-
ユニバーサル量化子の使用に慣れるためには、このセクションの最後にあるいくつかの演習を試すべきです。

Prop を他の型と区別するのは、従属矢印型の型付け規則、特に普遍的量子化器です。Α : Sort i と β : Sort j があると仮定すると、
式 β は変数 x : α に依存する可能性があります。すると (x : α) → β は Sort（imax i j）の要素であり、imax i j は j が 0 でない場合は i と j の最大値、そうでない場合は 0 です。

考えは以下の通りです。J が 0 でない場合、(x : α) → β は Sort の要素（max i j）です。言い換えれば、α から β への従属関数の型は、指数が i と j の最大である宇宙に「存在」します。
しかしながら、β がソート0、すなわち Prop の要素であると仮定します。その場合、(x : α) → β は、どのタイプの宇宙 α が存在していても、ソート0 の要素でもあります。
言い換えれば、β が α に依存する命題であるなら、∀ x : α、β は再び命題です。これは、Prop をデータではなく命題のタイプとして解釈することを反映しており、Prop が不適切である理由となります。

“Predicative”という用語は、20世紀の転換期における基礎的な発展に端を発し、ポアンカレやラッセルといった論理学者が、定義される性質そのものを含む集合上で性質を定量化して定義する際に生じる「悪循環」に集合論的パラドックスを帰属させました。
Α が任意の型である場合、α に対してすべての述語の型 α → Prop（「α のべき乗型」）を形成できることに注意してください。Prop の無定性は、α → Prop を量子化する命題を形成できることを意味します。
特に、α のすべての述語を量子化することにより α の述語を定義することができますが、これはかつて問題視された循環性のタイプとまさに同じです。
-/
